CHANGELOG.org
* COMMENT CHANGELOG tips:
1. Don't dump your git change logs into this file, write them yourself.
2. Keep entries short and user-focused,
3. Use non-technical language, but do speak in the vocabulary of your gem.
4. Don't document changes only of interest to the programmers, just those the
   user would find useful.
5. Give each heading a version number and an inactive date (C-c ! is useful here).

* Version 1.0.0
Initial stable release.

- Curses and truecolor renderers
- Shell, output, prompt, menu, search, and progress sessions
- Command-based terminal and session routing
- Completion, autosuggestion, and history support
- Status and alert displays
- Modal workflows
- Pager and scrolling modes
- Resize handling
- Configurable themes and key maps
